{
  "id": 3389,
  "slug": "a-comprehensive-guide-jp",
  "date": "2024-07-31T07:28:59",
  "url": "https://acumenintelligence.com/a-comprehensive-guide-jp/",
  "title": "ABM Success with Intent Data: A Comprehensive Guide",
  "html": "<p></p><p>ABMのメリットについては多く語られているが、ABMに必要な努力についてはあまり語られていない。</p>\n<p><span>アカウント・ベース・マーケティング（ABM）のメリットについては多く語られているが、ABMが必要とする真の努力の大きさについては、しばしば陰に隠れたままである。ABMは単なるマーケティング戦略ではなく、価値の高いターゲットアカウントの一部のみに焦点を当てるため、アカウントごとに相当な労力が必要となる。このような比較的小規模なアカウントからの収益ポテンシャルを最大化するために、ABMチームは、各バイイングチームのニーズと真に共鳴する、精密に設計されたキャンペーンを編成しなければならない。</span></p>\n<p><br /><br /></p>\n<span class=\" fusion-imageframe imageframe-none imageframe-20 hover-type-none\"><img width=\"1024\" height=\"768\" src=\"https://acumenintelligence.com/wp-content/uploads/2024/07/image1-4.png\" alt=\"\" class=\"img-responsive wp-image-3390\" srcset=\"https://acumenintelligence.com/wp-content/uploads/2024/07/image1-4-200x150.png 200w, https://acumenintelligence.com/wp-content/uploads/2024/07/image1-4-400x300.png 400w, https://acumenintelligence.com/wp-content/uploads/2024/07/image1-4-600x450.png 600w, https://acumenintelligence.com/wp-content/uploads/2024/07/image1-4-800x600.png 800w, https://acumenintelligence.com/wp-content/uploads/2024/07/image1-4.png 1024w\" sizes=\"(max-width: 1024px) 100vw, (max-width: 640px) 100vw, 800px\" /></span><p>アカウント・ベース・マーケティング（ABM）を成功させるためには、実務担当者とチームは、最初の挫折を受け入れるマインドセットを採用すべきである。</p>\n<p><span>アカウントベースドマーケティング（ABM）で卓越した成果を上げるには、最初の課題を成功への足がかりとして受け入れる考え方が必要だ。ABMが組織にとって強力な資産となるように、革新、改善、進化を受け入れる、十分に構造化された計画から始めることが極めて重要である。</span></p>\n<p>このような考え方が定着すれば、インテント・データはABMの成果を高める強力な触媒として浮上する。</p>\n<p><span>この考え方がしっかりと確立されれば、インテント・データの統合はABMの成果を高めるためのゲームチェンジャーとなる。この記事では、ABMにおいてインテント・データが変革的な役割を果たす4つの重要な領域を探る：</span></p>\n<ol>\n<li>活動ベースの精度 </li>\n</ol>\n<p>ターゲティング ABMでより多くの収益を上げるには、2つの重要なアプローチがある。1つの重要なアプローチは、観察されたアクティビティに基づく精密なターゲティングである。個人は、自分の興味に関連する情報にアクセスできる場所に集まる傾向があり、これは “購買意欲 “として知られる現象である。こうしたクラスターは、個人が購入に近づくにつれて顕著になる。</p>\n<p>しかし、ここに課題がある。これらの潜在的な購入者は、貴社のインバウンドチャネルに関与していない可能性があるのだ。インテンションデータは、バイヤーが集まっている市場内の活動エリアを明らかにすることで、解決策となり得る。これにより、ターゲティングの優先順位を精密に決めることができ、成功率の向上と成約期間の短縮につながる。</p>\n<ol>\n<li>バイイングセンターとのエンゲージメントの強化 </li>\n</ol>\n<p>潜在的な買い手がどこに集まっているかを理解することは、始まりに過ぎない。次のステップでは、これらのバイヤーと、アカウント内の関連する購買チームとのエンゲージメントを強化する必要がある。効果的なエンゲージメントの鍵は、アカウント内の個人の役割と購買サイクルにおける立場を深く理解することである。</p>\n<p>ファーストパーティ・インテント・データは、バイヤーの役職やコンテンツ消費の嗜好に関する洞察を提供し、バイヤーがどのような人物で、組織内でどのような仕事をしているのかを包括的に理解する。このような知識を活用することで、彼らの関心に沿ったメッセージを自信を持って発信することができる。</p>\n<p>アクティブな個人の特定に加え、インテント・シグナルは、アカウント内の購買センターの形成を明らかにする。購買グループを効果的に関与させるには、あなたの組織を際立たせる独自の価値を提供する必要がある。高付加価値オファー（HVO）やカスタムウェビナーのような戦略は、関連するインテント・シグナルとリンクしており、この文脈で顕著な効果を示している。</p>\n<ol>\n<li>法人営業の活性化</li>\n</ol>\n<p>ABMは、ターゲットアカウントからより多くの収益を引き出すことを中心に展開され、営業の効果はこの方程式において極めて重要な要素です。効果的な営業活動は、適切なバイヤーを特定し、説得力のあるエンゲージメント戦略を策定し、いつ接触を開始すべきかを的確に把握することにかかっている。バイヤージャーニーにおける早期エンゲージメントは、より高い効果をもたらします。あなたの組織とその問題解決能力に対する認知度を高めることで、売り手は買い手の候補リストに加えられる可能性を高めることができる。早期の購入意向データは貴重なインサイトを提供し、営業チームに接触する機が熟していることを知らせます。</p>\n<p>質の高い、データ主導の営業開発担当者（SDR）のアウトリーチは、無作為、ハイベロシティ、ターゲット外のアプローチよりも優れています。ファーストパーティのインテント・データにはオプトインした個人も含まれるため、SDRはアカウント内の特定の個人を特定し、エンゲージすることができます。インテント・データは豊富なインサイトを提供するため、SDRはバイヤーの役割、興味、ニーズに合わせてアウトリーチを調整することができます。個人のインテンションシグナルの強さは、営業チームがアウトリーチの優先順位を決める際にさらに役立ち、積極的に市場に参入している個人とのエンゲージメントを確実にします。</p>\n<ol>\n<li>高度なABM：営業とマーケティングの連携強化 </li>\n</ol>\n<p>高度なインテント・データをABM戦略に統合することで、見落とされがちだが、非常に大きな効果が得られるのは、営業とマーケティングの連携強化である。ABMは、営業チームとマーケティングチームが一体となり、共通のビジョンと目標を共有することで成功する。インテント・データは、ギャップを埋め、真実の共有ソースとアカウントの優先順位の共通理解を提供する。インテント・データから得られる洞察により、両チームは調和を保ちながら、影響力の高いアカウントに努力を集中し、エンゲージメントを最大化するためにメッセージをカスタマイズすることができる。この連携は、ABMのオペレーションを合理化するだけでなく、コンバージョン率の向上、案件の早期成約、そして最終的には収益の拡大につながる。</p>\n<p>高度なインテント・データをABM戦略に統合することで、営業とマーケティングのコラボレーションの可能性を引き出すことができる。うまく調整されたアプローチにより、チームはB2Bセールスの複雑な状況をより効果的にナビゲートすることができ、各アカウントが吟味されたサービスを受けられるようになります。インテント・データ、ABM、営業とマーケティングの連携強化の相乗効果は、B2Bマーケティングと営業活動に革命をもたらし、具体的な成果と収益の可能性を最大化する可能性を秘めている。</p>\n<p><span>要約すると、インテント・データは、営業チームが貴重な機会を見落とさないようにする上で極めて重要な役割を果たす。インテント・データを活用することで、営業チームはアカウントをよりよく理解し、営業チームとのやり取りの盲点をなくすことができる。変化はすぐには起こらず、プロセスの転換が必要になるかもしれないが、ABMプログラムにインテント・データを統合することは戦略的な動きである。このような下準備に注意を払い、目標やデータソースに関してマーケティングチームと営業チームの間で整合性を確保することで、Go-to-Market（GTM）戦略を成功に導くことができる。</span></p>\n<a class=\"fusion-button button-flat fusion-button-default-size button-default fusion-button-default button-5 fusion-button-default-span fusion-button-default-type\" target=\"_self\" href=\"https://acumenintelligence.com/contact-us/\"><span class=\"fusion-button-text\">お問い合わせはこちら</span></a><p></p>\n",
  "excerpt": "",
  "categories": [],
  "tags": []
}